#! /usr/bin/python3


SECURITIES = {
    # on_market
    # A股
    '501046': ('财通福鑫', '主动', 2),
    '512170': ('医疗ETF', '医药', 3),
    '512260': ('500低波动ETF', '指数', 2),
    '515910': ('质量ETF', '指数', 2),
    '600009': ('上海机场', '股票', 3),

    # QDII
    '159501': ('纳指100ETF嘉实', '指数', 3),
    '159513': ('纳指100ETF大成', '指数', 3),
    '159632': ('纳指100ETF华安', '指数', 3),
    '159659': ('纳指100ETF招商', '指数', 3),
    '159660': ('纳指100ETF汇添富', '指数', 3),
    '159696': ('纳指100ETF易方达', '指数', 3),
    '159941': ('纳指100ETF广发', '指数', 3),
    '161130': ('纳指100LOF易方达', '指数', 3),
    '513100': ('纳指100ETF国泰', '指数', 3),
    '513110': ('纳指100ETF华泰柏瑞', '指数', 3),
    '513300': ('纳指100ETF华夏', '指数', 3),
    '513390': ('纳指100ETF博时', '指数', 3),
    '513870': ('纳指100ETF富国', '指数', 3),

    '159509': ('纳指科技ETF景顺长城', '指数', 3),
    '161128': ('标普科技LOF易方达', '指数', 3),

    '159612': ('标普500ETF国泰', '指数', 3),
    '159655': ('标普500ETF华夏', '指数', 3),
    '161125': ('标普500LOF易方达', '指数', 3),
    '513500': ('标普500ETF博时', '指数', 3),
    '513650': ('标普500ETF南方', '指数', 3),

    # 港股
    '00388': ('香港交易所', '股票', 3),
    '00700': ('腾讯控股', '中概股', 3),
    '07200': ('FL二南方恒指', '股票', 3),
    '01810': ('小米集团-W', '中概股', 3),
    '03690': ('美团-W', '中概股', 3),
    '09618': ('京东集团-W', '中概股', 3),
    '09988': ('阿里巴巴-SW', '中概股', 3),
    '03033': ('南方恒生科技', '中概股', 3),

    # 美股
    'AAPL': ('苹果', '股票', 3),
    'ARKW': ('ArkWeb', '股票', 3),
    'BABA': ('阿里巴巴', '中概股', 3),
    'BILI': ('哔哩哔哩', '中概股', 3),
    'BITB': ('BitwiseETF', '虚拟币', 3),
    'BRK': ('伯克希尔B', '股票', 3),
    'DVY': ('道琼斯股息ETF', '指数', 2),
    'EWJ': ('日本ETF', '指数', 2),
    'EMXC': ('新兴市场ETF', '指数', 2),
    'GBTC': ('GrayscaleBitcoin', '虚拟币', 3),
    'GS': ('高盛', '股票', 3),
    'IBIT': ('iSharesBitcoin', '虚拟币', 3),
    'IWN': ('罗素2000价值ETF', '指数', 2),
    'KWEB': ('中国海外互联网ETF', '中概股', 3),
    'MAGS': ('7巨头ETF', '股票', 3),
    'MINT': ('美国增强型短债', '债券', 1),
    'MSFT': ('微软', '股票', 3),
    'NVDA': ('英伟达', '股票', 3),
    'PDD': ('拼多多', '中概股', 3),
    'QQQ': ('纳斯达克100', '指数', 2),
    'SPY': ('标普500', '指数', 2),
    'TLT': ('美国20年期国债', '债券', 2),

    # off_market
    # 宽基指数
    'F000082': ('嘉实研究阿尔法', '指数', 2),
    'F000172': ('华泰柏瑞量化增强', '指数', 2),
    'F000270': ('建信灵活配置', '指数', 2),
    'F000877': ('华泰柏瑞量化优选', '指数', 2),
    'F000311': ('景顺长城沪深300', '指数', 2),
    'F000978': ('景顺长城量化精选', '指数', 2),
    'F001015': ('华夏沪深300', '指数', 2),
    'F001074': ('华泰柏瑞量化驱动', '指数', 2),
    'F001244': ('华泰柏瑞量化智慧A', '指数', 2),
    'F001556': ('天弘中证500A', '指数', 2),
    'F002670': ('万家沪深300A', '指数', 2),
    'F003986': ('申万菱信中证500', '指数', 2),
    'F004716': ('信诚量化阿尔法', '指数', 2),
    'F005994': ('国投瑞银中证500', '指数', 2),
    'F006022': ('富国大盘价值量化精选', '指数', 2),
    'F007143': ('国投瑞银沪深300指数量化A', '指数', 2),
    'F011498': ('富国沪深300基本面精选A', '指数', 2),
    'F110003': ('易方达上证50指数A', '指数', 2),
    'F161039': ('富国中证1000', '指数', 2),
    'F163407': ('兴全沪深300A', '指数', 2),
    'F165310': ('建信沪深300', '指数', 2),
    'F161017': ('富国中证500', '指数', 2),
    'F310318': ('申万菱信沪深300', '指数', 2),
    'F450004': ('国富深化价值', '指数', 2),

    # 策略指数
    'F003318': ('景顺长城中证500低波动', '指数', 2),
    'F006341': ('中金MSCI中国A股国际质量A', '指数', 2),
    'F090010': ('大成中证红利指数A', '指数', 2),
    'F501050': ('华夏上证50AH', '指数', 2),
    'F519671': ('银河沪深300价值', '指数', 2),
    'F540012': ('汇丰晋信恒生股票龙头', '指数', 2),

    # 行业指数
    'F001594': ('天弘中证银行A', '指数', 2),
    'F004069': ('南方中证全指证券', '指数', 2),
    'F006327': ('易方达中证海外50ETF联接', '中概股', 3),
    'F010202': ('天弘中证科技100', '指数', 3),
    'F012348': ('天弘恒生科技', '中概股', 3),
    'F164906': ('交银中证海外中国互联网', '中概股', 3),
    'F501009': ('汇添富中证生物科技', '医药', 3),
    'F501090': ('华宝中证消费龙头', '指数', 2),

    # 货币
    'XJB': ('现金宝', '货币', 0),
    'F003474': ('南方天天利B', '货币', 0),
    'F000642': ('汇添富货币市场C', '货币', 0),
    'F000730': ('博时现金宝', '货币', 0),
    'F000773': ('万家现金宝', '货币', 0),

    # 深度价值
    'F000480': ('东方红新动力', '主动', 2),
    'F001810': ('中欧潜力价值', '主动', 2),
    'F004350': ('汇丰晋信价值先锋', '主动', 2),
    'F006567': ('中泰星元灵活配置A', '主动', 2),
    'F006624': ('中泰玉衡价值优选', '主动', 2),
    'F007549': ('中泰开阳价值优选混合A', '主动', 2),
    'F260112': ('景顺长城能源基建', '主动', 2),

    # 成长价值
    'F110011': ('易方达优质精选', '主动', 2),
    'F001112': ('东方红中国优势', '主动', 2),
    'F001487': ('宝盈优势产业', '主动', 3),
    'F005267': ('嘉实价值精选', '主动', 2),
    'F005827': ('易方达蓝筹精选', '主动', 2),
    'F100020': ('富国天益价值', '主动', 2),
    'F169101': ('东方红睿丰', '主动', 2),
    'F519712': ('交银阿尔法核心', '主动', 2),

    # 成长
    'F000595': ('嘉实泰和混合', '主动', 3),
    'F000603': ('易方达创新驱动', '主动', 3),
    'F001538': ('上投摩根科技前沿', '主动', 3),
    'F005354': ('富国沪港深行业精选A', '主动', 2),
    'F110013': ('易方达科翔', '主动', 2),
    'F161005': ('富国天惠成长', '主动', 2),
    'F377240': ('上投摩根新兴动力', '主动', 3),
    'F519035': ('富国天博创新', '主动', 2),
    'F519704': ('交银先进制造混合', '主动', 2),

    # 医药
    'F001717': ('工银前沿医疗', '医药', 3),
    'F001766': ('上投摩根医疗健康', '医药', 3),
    'F003095': ('中欧医疗健康A', '医药', 3),
    'F004851': ('广发医疗保健', '医药', 3),
    'F006002': ('工银医药健康行业', '医药', 3),
    'F006228': ('中欧医疗创新A', '医药', 3),

    # 均衡
    'F002340': ('富国价值优势', '主动', 2),
    'F004674': ('富国新机遇灵活配置', '主动', 2),
    'F004868': ('交银股息优化', '主动', 2),
    'F005587': ('安信比较优势', '主动', 2),
    'F163402': ('兴全趋势投资', '主动', 2),
    'F163406': ('兴全合润', '主动', 2),
    'F163415': ('兴全商业模式优选', '主动', 2),
    'F166002': ('中欧新蓝筹A', '主动', 2),
    'F519688': ('交银精选', '主动', 2),
    'F750001': ('安信策略精选', '主动', 2),

    'F001974': ('景顺长城量化新动力', '主动', 2),
    'F005259': ('建信龙头企业', '主动', 2),
    'F540003': ('汇丰晋信动态策略A', '主动', 2),

    # 蛋卷组合
    'CSI666': ('螺丝钉指数组合', '指数', 2),
    'CSI1019': ('钉钉宝365天组合', '债券', 1),
    'CSI1014': ('我要稳稳的幸福', '债券', 1),
    'CSI1033': ('螺丝钉主动优选', '主动', 2),
    'TIA06019': ('螺丝钉银钉宝365天', '债券', 1),
    'TIA06020': ('螺丝钉金钉宝主动优选', '主动', 2),
    'TIA06028': ('螺丝钉金钉宝指数增强', '指数', 2),

    # 理财
    '205001': ('理财', '货币', 0),
    '招智睿远平衡二十七期': ('理财', '债券', 1),
    '华夏理财现金1号A': ('理财', '货币', 0),
    '尊享日日盈': ('理财', '货币', 0),
    '招赢日日盈': ('理财', '货币', 0),

    # 现金
    'cash': ('现金', '货币', 0)
}


def main():
    pass


if __name__ == '__main__':
    main()
